# Homebrew taps
tap "homebrew/core" # official Homebrew formulae
tap "homebrew/cask" # official Homebrew casks
tap "jorgelbg/tap" # custom tap for pinentry-touchid
# tap "kardolus/chatgpt-cli" # third-party ChatGPT CLI tap
tap "gantoreno/macfetch" # custom macfetch tap
tap "dagger/tap" # Dagger CLI and related tools
tap "iwe-org/iwe" # IWE knowledge management tools
tap "nikolaeu/numi" # tap for numi-cli
tap "ossianhempel/tap" # tap for Things 3 CLI
tap "steipete/tap" # bird/camsnap/peekaboo/summarize/tmuxwatch
tap "supabase/tap" # official Supabase CLI tap
tap "txtx/taps" # surfpool blockchain deployment tool
tap "librespeed/tap" # librespeed-cli tap
tap "jorgelbg/tap" # tap for pinentry-touchid
tap "ossianhempel/tap" # tap for Things 3 CLI
tap "gabrielkoerich/tap" # tap for Orchestrator + other apps

# Core CLI and shell tooling
brew "ack" # search tool like grep optimized for source code
brew "act" # run GitHub Actions locally
brew "age" # modern file encryption tool
brew "bat" # cat clone with syntax highlighting
brew "bats-core" # Bash Automated Testing System
brew "coreutils" # GNU core utilities
brew "findutils" # GNU find/xargs/locate utilities
brew "gnu-sed" # GNU sed
brew "gnu-tar" # GNU tar
brew "grep" # GNU grep/egrep/fgrep
brew "gzip" # GNU gzip compression
brew "htop" # interactive process viewer
brew "just" # command runner
brew "moreutils" # misc unix tools like sponge
brew "openssh" # SSH client/server tools
brew "p7zip" # 7z archiver implementation
brew "ripgrep" # fast recursive search
brew "screen" # terminal multiplexer
brew "shellcheck" # shell script linter
brew "ssh-copy-id" # install SSH keys on remote hosts
brew "tmux" # terminal multiplexer
brew "tree" # directory tree viewer
brew "vim" # vi-compatible editor
brew "watch" # run commands periodically
brew "wget" # network downloader
brew "xz" # xz/lzma compression tools
brew "yq" # YAML/JSON/XML/CSV processor
brew "zsh" # Z shell

# Development and build tooling
brew "beancount-language-server" # language server for Beancount files
brew "bison" # parser generator
brew "cairo" # 2D graphics library
brew "cmake" # cross-platform build system
brew "deno" # secure JS/TS runtime
brew "flyctl" # Fly.io CLI
brew "gcc" # GNU compiler collection
brew "git" # distributed version control
brew "git-extras" # extra Git commands
brew "git-town" # high-level Git workflow CLI
brew "graphql-cli" # GraphQL development workflows
brew "jpeg" # JPEG image tools/library
brew "lazydocker" # terminal UI for Docker
brew "lftp" # advanced file transfer CLI
brew "libffi" # foreign function interface library
brew "librsvg" # SVG rendering library
brew "llvm" # compiler toolchain infrastructure
brew "markdown-oxide" # markdown knowledge-base LSP
brew "neovim" # extensible Vim fork
brew "nvim" # neovim alias formula retained for compatibility
brew "node" # JavaScript runtime
brew "nvm" # Node.js version manager
brew "openssl" # TLS/crypto toolkit
brew "openssl@3" # OpenSSL v3 formula
brew "pandoc" # document conversion tool
brew "pango" # text layout/rendering engine
brew "pipx" # isolated Python app installer
brew "pkg-config" # compiler/linker metadata helper
brew "pkgconf" # pkg-config compatible implementation
brew "poetry" # Python dependency manager
brew "pre-commit" # Git pre-commit hook manager
brew "python@3.13" # Python runtime
brew "rclone" # cloud storage sync tool
brew "shadowsocks-rust" # shadowsocks proxy implementation
brew "supabase/tap/supabase" # Supabase CLI
brew "ta-lib" # technical analysis library
brew "talib" # legacy ta-lib formula name retained
brew "tart" # macOS/Linux VMs on Apple Silicon
brew "tor" # anonymizing network client
brew "txtx/taps/surfpool" # blockchain contract deployment CLI
brew "uv" # fast Python package manager
brew "woff2" # web font conversion tools

# Security, privacy, networking, and research tooling
brew "aircrack-ng" # Wi-Fi security auditing suite
brew "bfg" # git history cleaner for large/binary files
brew "binutils" # GNU binary utilities
brew "binwalk" # firmware analysis tool
brew "cifer" # Caesar/Vigenere-like cipher utility
brew "dex2jar" # Android dex to Java jar converter
brew "dns2tcp" # tunnel TCP over DNS
brew "fcrackzip" # ZIP password cracker
brew "foremost" # file carving forensic tool
brew "ghostscript" # PostScript/PDF processor
brew "giflib" # GIF processing library/tools
brew "gitleaks" # secret scanning tool
brew "gnupg" # OpenPGP encryption suite
brew "gpg" # GNU Privacy Guard alias/tooling
brew "hashpump" # hash length-extension utility
brew "hydra" # network login cracker
brew "imagemagick" # image conversion/manipulation suite
brew "john" # John the Ripper password cracker
brew "knock" # port-knocking client/server
brew "netpbm" # image format conversion tools
brew "nextdns" # NextDNS CLI client
brew "nmap" # network scanner
brew "pngcheck" # PNG integrity checker
brew "socat" # socket relay utility
brew "speedtest-cli" # internet bandwidth tester
brew "librespeed-cli" # internet bandwidth tester
brew "sqlmap" # SQL injection testing tool
brew "tcpflow" # capture TCP flows
brew "tcpreplay" # replay captured packets
brew "tcptrace" # TCP packet analysis
brew "ucspi-tcp" # tcpserver and related tools
brew "xpdf" # PDF text/tools suite

# Personal productivity and system operations
brew "macfetch" # macOS system summary utility
brew "gastown" # multi-agent workspace manager
brew "orchestrator" # multi-agent orchestrator & delegator
brew "gemini-cli" # Google Gemini CLI
brew "gh" # GitHub CLI
brew "howdoi" # coding answers from terminal
brew "iwe-org/iwe/iwe" # markdown-based PKM for developers
brew "jq" # JSON processor
brew "pinentry-touchid" # Touch ID pinentry integration
brew "mackup" # backup/restore app settings
brew "maclaunch" # inspect startup items
brew "mactop" # Apple Silicon process monitor
brew "mas" # Mac App Store CLI
brew "nikolaeu/numi/numi-cli" # smart calculator CLI
brew "opencode" # terminal AI coding agent
brew "things3-cli" # Things 3 CLI
brew "pass" # password manager
brew "pass-otp" # OTP extension for pass
brew "pinentry-mac" # macOS pinentry
brew "pv" # pipe viewer
brew "steipete/tap/bird" # X/Twitter CLI
brew "steipete/tap/camsnap" # RTSP/ONVIF camera capture CLI
brew "steipete/tap/peekaboo" # screenshot and vision analysis CLI
brew "steipete/tap/summarize" # URL/text summarizer CLI
brew "steipete/tap/tmuxwatch" # live tmux dashboard

# GUI apps and desktop tooling
cask "1password-cli" # 1Password command-line tool
cask "alfred" # productivity launcher
# cask "alienator88-sentinel" # security monitoring utility
cask "basictex" # compact TeX distribution
cask "claude" # Claude desktop app
cask "claude-code" # Claude Code app bundle
cask "codex" # Codex app bundle
cask "cryptomator" # encrypted cloud storage vaults
cask "dagger/tap/container-use" # containerized coding environments
cask "discord" # team chat app
cask "ghostty" # terminal emulator
cask "github" # GitHub Desktop
cask "handy" # speech-to-text app
cask "imageoptim" # image optimization app
cask "iterm2" # terminal emulator
cask "keepassxc" # password manager
cask "knockknock" # persistent items inspection tool
# cask "little-snitch" # outbound firewall
cask "lulu" # open-source outbound firewall
# cask "micro-snitch" # mic/camera activity monitor
cask "numi" # calculator app
cask "obsidian" # markdown knowledge base app
cask "onyx" # macOS maintenance utility
cask "pareto-security" # security checklist app
cask "passepartout" # VPN client
cask "pearcleaner" # app uninstaller and cleaner
cask "privileges" # admin rights switcher
cask "qlmarkdown" # Quick Look for markdown
cask "rectangle" # window manager shortcuts
cask "telegram" # messaging app
cask "tailscale" # zero-trust mesh VPN
cask "the-unarchiver" # archive extractor
cask "utm" # virtualization app
cask "zed" # code editor

# Mac App Store apps
mas "Dato", id: 1470584107 # menu bar world clocks/calendar
mas "Pandan", id: 1569600264 # quick productivity timer
mas "One Thing", id: 1604176982 # menu bar focus reminder
mas "WhatsApp", id: 310633997 # messaging app
mas "Numbers", id: 409203825 # Apple spreadsheet app
mas "Strongbox", id: 897283731 # KeePass-compatible vault app
mas "Things", id: 904280696 # task manager

# Optional apps previously used (kept as reference)
# cask "authy" # 2FA app
# cask "postman" # API client
# cask "sublime-text" # text editor
# cask "vlc" # media player
# cask "docker-desktop" # Docker Desktop
# cask "kap" # screen recorder
# cask "tunnelblick" # OpenVPN client
