tap "alexanderwillner/tap"
tap "bramstein/webfonttools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "kabel/php-ext"
tap "mongodb/brew"
tap "rbenv/tap"
tap "shivammathur/php"
brew "ack"
brew "act"
brew "giflib"
brew "libpng"
brew "bat"
brew "beanstalkd"
brew "bfg"
brew "binutils"
brew "pcre2"
brew "glib"
brew "pkg-config"
brew "xz"
brew "python@3.9"
brew "cairo"
brew "gmp"
brew "harfbuzz"
brew "python@3.10"
brew "gobject-introspection"
brew "numpy"
brew "jpeg", link: true
brew "p7zip"
brew "pillow"
brew "binwalk"
brew "boost"
brew "brew-php-switcher"
brew "cifer"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "libssh2"
brew "openldap"
brew "dark-mode"
brew "dex2jar"
brew "dns2tcp"
brew "dnsmasq"
brew "fastlane"
brew "fcrackzip"
brew "findutils"
brew "foremost"
brew "freetds"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "git-extras"
brew "git-filter-repo"
brew "git-town"
brew "gnu-sed"
brew "go"
brew "grep"
brew "hashcat"
brew "hashpump"
brew "htop"
brew "libfido2"
brew "libssh"
brew "mysql-client"
brew "hydra"
brew "innotop"
brew "jasper"
brew "john"
brew "jq"
brew "just"
brew "knock"
brew "ldns"
brew "libgit2"
brew "libpq"
brew "pango"
brew "librsvg"
brew "mackup"
brew "maclaunch"
brew "mas"
brew "node@16"
brew "mongosh"
brew "moreutils"
brew "python-tabulate"
brew "mycli"
brew "mysql", restart_service: true
brew "neofetch"
brew "netpbm"
brew "nghttp2"
brew "nginx"
brew "ngrep"
brew "nmap"
brew "nvm"
brew "openssh"
brew "openssl@3"
brew "perl"
brew "php"
brew "pngcheck"
brew "postgresql@13", restart_service: true
brew "pv"
brew "qt@5"
brew "quantlib"
brew "r"
brew "redis", restart_service: true
brew "ruby@2.7"
brew "screen"
brew "socat"
brew "speedtest-cli"
brew "sqlmap"
brew "ssh-copy-id"
brew "tcpflow"
brew "telnet"
brew "tmux"
brew "tor"
brew "ucspi-tcp"
brew "vim"
brew "watch"
brew "wget"
brew "woff2"
brew "xpdf"
brew "zsh"
brew "alexanderwillner/tap/things.sh"
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
brew "kabel/php-ext/php-imap"
brew "mongodb/brew/mongodb-community"
cask "alfred"
cask "anaconda"
cask "authy"
cask "caffeine"
cask "cakebrew"
cask "chatgpt"
cask "cryptomator"
cask "discord"
cask "github"
cask "google-chrome"
cask "imageoptim"
cask "iterm2"
cask "keybase"
cask "knockknock"
cask "notion"
cask "obsidian"
cask "postman"
cask "qlmarkdown"
cask "spectacle"
cask "sublime-text"
cask "the-unarchiver"
cask "tribler"
cask "utm"
cask "vlc"
